GetJobHistory.xml

<soap:Envelope
		xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
		xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/printâ€>
	<soap:Header>
		<wsa:To>%EndPoint%</wsa:To>
		<wsa:Action>
      		http://schemas.microsoft.com/windows/2006/08/wdp/print/GetJobHistory
		</wsa:Action>
		<wsa:MessageID>urn:uuid:%MessageId%</wsa:MessageID>
	</soap:Header>
	<soap:Body>
		<wprt:GetJobHistoryRequest/>
	</soap:Body>
</soap:Envelope>
